{"pageProps":{"frontmatter":{"title":"maintaining my statically generated tech blog","date":"2022/03/14","excerpt":"How I manage to maintain this blog using Notion, Next.js and Github Pages","tags":"Frontend"},"slug":"static-blog-with-notion-cms","content":"\nI always wanted to have a personal blog, [but never actually put the time to get it done](/blog/developers-productivty-and-procrastination). Creating meaningful blog posts is not an easy task, might as well have systems or tools that can be used to help us do it easier and faster.\n\nI tried a lot of ways and flavors of blogging. Wordpress was heavyweight and clunky, Medium or other micro-blogging services did not just feel _right_ to me. Naturally as a web developer, I wanted to have something of my own.\n\nThis website was built upon the Next.js React framework. The repository containes React components for styling and layout and markdown files for the blog posts and actual content.\n\nThe `getStaticProps` function is called by Next.js when the page is first loaded. It is then used to fetch the markdown content using `fs` and inject it as props into the components.\n\n```javascript\n// reading *.md files and converting them to usable state\nexport async function getStaticProps() {\n    const posts = fs\n        .readdirSync(path.join(\"posts\"))\n        .map((file) => fs.readFileSync(path.join(\"posts\", file), \"utf-8\"));\n    return {\n        props: {\n            posts,\n        },\n    };\n}\n```\n\nWe can now facilitate Next.js SSG (static site generation) to render and export the blog posts\nas static HTML files.\n\n```Bash\n$ next export\n```\n\nNow we have all possible routes and contents statically available to us in the `/out` directory.\n\nLet's publish the generated files to Github Pages. I use the `gh-pages` CLI utility to publish the static HTML files to a specific branch.\n\nGithub automatically detects push-events to this branch and then deploys my newly created HTML and assets files to the web!\n\nWith Utterance Github app you can have fully functional comment section in your posts! It uses Github issues under the hood and I could easily integrated this with React.\n\n## All in one go\n\nYou can aggergate all of the above into one command, or even register it as a NPM command to run every time you want to publish your blog.\n\n```Bash\n$ yarn build && yarn export && touch out/.nojekyll && gh-pages -t -d out\n```\n"},"__N_SSG":true}